#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/swdemo/kubernetes-ops-staging-5-route53-hostedzone/runs/run-HN6ThgYtgnkyy9jn

Waiting for the plan to start...

Terraform v1.3.4
on linux_amd64
Initializing plugins and modules...
module.route53-hostedzone.aws_route53_zone.this: Refreshing state... [id=Z08611102Y9A1LXI0QCS3]
module.route53-hostedzone.aws_kms_key.this: Refreshing state... [id=d327f7ec-90e9-4f12-9d43-8e0afc51736f]
module.route53-hostedzone.aws_route53_key_signing_key.this: Refreshing state... [id=Z08611102Y9A1LXI0QCS3,key]
module.route53-hostedzone.aws_route53_hosted_zone_dnssec.this: Refreshing state... [id=Z08611102Y9A1LXI0QCS3]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.route53-hostedzone.aws_route53_key_signing_key.this has been deleted
  - resource "aws_route53_key_signing_key" "this" {
      - hosted_zone_id             = "Z08611102Y9A1LXI0QCS3" -> null
        id                         = "Z08611102Y9A1LXI0QCS3,key"
        name                       = "key"
        # (12 unchanged attributes hidden)
    }

  # module.route53-hostedzone.aws_route53_zone.this has been deleted
  - resource "aws_route53_zone" "this" {
      - id                  = "Z08611102Y9A1LXI0QCS3" -> null
        name                = "k8s.staging.swdemo.com"
      - name_servers        = [
          - "ns-1474.awsdns-56.org",
          - "ns-1543.awsdns-00.co.uk",
          - "ns-158.awsdns-19.com",
          - "ns-974.awsdns-57.net",
        ] -> null
        tags                = {
            "ops_env"              = "staging"
            "ops_managed_by"       = "terraform"
            "ops_owners"           = "devops"
            "ops_source_repo"      = "kubernetes-ops"
            "ops_source_repo_path" = "terraform-environments/aws/staging/5-route53-hostedzone"
        }
      - zone_id             = "Z08611102Y9A1LXI0QCS3" -> null
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.route53-hostedzone.aws_route53_hosted_zone_dnssec.this will be created
  + resource "aws_route53_hosted_zone_dnssec" "this" {
      + hosted_zone_id = (known after apply)
      + id             = (known after apply)
      + signing_status = "SIGNING"
    }

  # module.route53-hostedzone.aws_route53_key_signing_key.this will be created
  + resource "aws_route53_key_signing_key" "this" {
      + digest_algorithm_mnemonic  = (known after apply)
      + digest_algorithm_type      = (known after apply)
      + digest_value               = (known after apply)
      + dnskey_record              = (known after apply)
      + ds_record                  = (known after apply)
      + flag                       = (known after apply)
      + hosted_zone_id             = (known after apply)
      + id                         = (known after apply)
      + key_management_service_arn = "arn:aws:kms:us-east-1:795740076858:key/d327f7ec-90e9-4f12-9d43-8e0afc51736f"
      + key_tag                    = (known after apply)
      + name                       = "key"
      + public_key                 = (known after apply)
      + signing_algorithm_mnemonic = (known after apply)
      + signing_algorithm_type     = (known after apply)
      + status                     = "ACTIVE"
    }

  # module.route53-hostedzone.aws_route53_zone.this will be created
  + resource "aws_route53_zone" "this" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "k8s.staging.swdemo.net"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags                = {
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/5-route53-hostedzone"
        }
      + tags_all            = {
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/5-route53-hostedzone"
        }
      + zone_id             = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ domain_name  = "k8s.staging.swdemo.com" -> "k8s.staging.swdemo.net"
  ~ name_servers = [
      - "ns-1474.awsdns-56.org",
      - "ns-1543.awsdns-00.co.uk",
      - "ns-158.awsdns-19.com",
      - "ns-974.awsdns-57.net",
    ] -> (known after apply)
  ~ zone_id      = "Z08611102Y9A1LXI0QCS3" -> (known after apply)

```


</details>

*Pusher: @RajAlexander, Action: `pull_request`*